01 Importing libraries

In [11]:
#Import libraries
import pandas as pd
import numpy as np
import os

In [12]:
#folder path

path = r'C:\Users\kanch\Documents\10-08-2023 Instacart Basket Analysis'

In [14]:
# Importing product.csv data set

df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data','4.3_orders_products' ,'products.csv'), index_col = False)

In [16]:
# Importing orders_wrangled.csv data set

df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# Consistency Checks

In [46]:
Mixed type Data

# Create a new test dataframe
# The first command, df_test = pd.DataFrame(), creates a new dataframe called df_test. 

df_test = pd.DataFrame()

In [47]:
# Create a mixed type column
# The second command, df_test['mix'] = ['a', 'b', 1, True], creates a new column, mix, within df_test and fills it with numeric, string, and boolean values.

df_test['mix'] = ['a', 'b', 1, True]

In [48]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [49]:
# Check for mixed types

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [50]:
# Changing data type to string

df_test['mix'] = df_test['mix'].astype('str')

In [51]:
# Recheck for mixed data type

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col, ' mixed')
  else: print (col, ' consistent')

mix  consistent

# Missing Values

In [52]:
# What this does is assign the function isnull() to the df_prods dataframe, then sum the result with the attached sum() function.
# The isnull() function is used to find missing observations, with “observations” here referring to entries in your dataframe.
# Think of them like cells in Excel.

df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [53]:
# To actually view these 16 values, you can create a subset of the dataframe

df_nan = df_prods[df_prods["product_name"].isnull() == True]

In [54]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

# Addressing missing values

In [55]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [56]:
df_prods.median()

C:\Users\kanch\AppData\Local\Temp\ipykernel_2600\3387230063.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df_prods.median()

product_id       24845.0
aisle_id            69.0
department_id       13.0
prices               7.1
dtype: float64

In [57]:
# Replacing missing value with mean
# df['column with missings'].fillna(mean value, inplace=True)

In [58]:
# Replacing missing value with median
# df['column with missings'].fillna(median value, inplace=True)

In [59]:
#  The shape function returns the number of rows and columns in a dataframe.

df_prods.shape

(49693, 5)

In [60]:
# Create dataframe without missing values in 'product_name' column

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [61]:
# Compare row and column numbers for new dataframe
# Your new dataframe should have exactly 16 less rows than the original dataframe (the same as the number of missing values).

df_prods_clean.shape

(49677, 5)

In [63]:
# Check again for mixed-type data after filtering out missing values

for col in df_prods_clean.columns.tolist():
  weird = (df_prods_clean[[col]].applymap(type) != df_prods_clean[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods_clean[weird]) > 0:
    print (col)

# Duplicates

In [65]:
# Finding full duplicates within dataframe:

df_dups = df_prods_clean[df_prods_clean.duplicated()]

# This code creates a new subset of df_prods_clean: df_dups, containing only rows that are duplicates.
# The duplicated() function is what identifies duplicate rows.
# It’s run on the df_prods_clean dataframe. Any duplicate rows that it finds are saved within the new df_dups dataframe.

In [66]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [67]:
# df.drop_duplicates()

In [68]:

# Before doing so, let’s check the current number of rows in your df_prods_clean dataframe so that you can compare the number after removing the duplicates

df_prods_clean.shape

(49677, 5)

In [69]:
# Creating a new dataframe that doesn’t include the duplicates
# df_prods_clean_no_dups that contains only the unique rows from df_prods_clean.

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [70]:
# You now have 49,672 rows in your dataframe. The five duplicates have been successfully deleted!

df_prods_clean_no_dups.shape

(49672, 5)

4.5 Data Consistency Checks

In [17]:
# Create a new test dataframe

df_test = pd.DataFrame()

In [22]:
# Run the df.describe() function on your df_ords dataframe
# Tip: Keep an eye on min and max values!

df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [18]:
# Check for mixed-type data in df_ords dataframe.

df_test['mix'] = ['a', 'b', 1, True]

In [19]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [23]:
# find mixed-type data, fix it.

# Check for mixed-type data in your df_ords dataframe.

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col, ' mixed')
  else: print (col, ' consistent')

Unnamed: 0  consistent
order_id  consistent
user_id  consistent
eval_set  consistent
order_number  consistent
orders_day_of_week  consistent
order_hour_of_day  consistent
days_since_prior_order  consistent

In [21]:
# Changing data type to string

df_test['mix'] = df_test['mix'].astype('str')

In [24]:
df_ords.dtypes

Unnamed: 0                  int64
order_id                    int64
user_id                     int64
eval_set                   object
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [27]:
# Run a check for missing values in your df_ords dataframe.

df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
eval_set                       0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [28]:
# Drop unnamed column for df_ords

df_ords = df_ords.drop(columns = ['Unnamed: 0'])

In [29]:
# Create subset for the missing values in df_ords

df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [30]:
# View missing values subset

df_ords_nan

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

In [ ]:
# The missing values in the "days_since_prior_order" column are likely due to the fact that they correspond to 
the first orders placed by customers. Since there are no prior orders to calculate the days since the last order, 
these missing values are reasonable and do not indicate data quality issues. Instead, they reflect the absence of a 
previous order for customers' initial purchases.

It's important to note that these missing values are not indicative of data entry errors; rather, they are a natural 
consequence of the ordering process and the calculation of the "days_since_prior_order" feature.

In [31]:
# Fill missing values in the "days_since_prior_order" column with 0
df_ords['days_since_prior_order'].fillna(0, inplace=True)

In [ ]:
## Handling Missing Values in df_ords: "days_since_prior_order"

To address the missing values in the "days_since_prior_order" column of the `df_ords` dataframe, I chose
to fill these missing values with the value 0. This decision is based on the understanding that these 
missing values are primarily associated with customers' first orders. Since there are no prior orders to
calculate the days since the last order for initial purchases, using 0 as the replacement value conveys that 
it's the first order and helps maintain the integrity of the feature.

By filling missing values with 0, we maintain consistency in the data and ensure that the 
"days_since_prior_order" column retains its meaningful interpretation. This approach aligns with the natural 
ordering process and accurately represents the absence of prior orders for first-time purchases.

In [33]:
# Run a check for duplicate values in your df_ords data.

df_ords_dups = df_ords[df_ords.duplicated()]

In [34]:
# Run a check for duplicate values in your df_ords data.

df_ords_dups = df_ords[df_ords.duplicated()]

In [35]:
# View df_ords_dups

df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

In [36]:
df_ords_dups.size

0

In [38]:
#Folder path
exportPath = r'C:\Users\kanch\Documents\10-08-2023 Instacart Basket Analysis\02 Data\Prepared Data'

In [84]:
#Export df_prods_clean_no_dups

df_prods_clean_no_dups.to_csv(os.path.join(exportPath, 'products_checked.csv'))

In [83]:
# Export final df_ords 

df_ords.to_csv(os.path.join(exportPath, 'orders_checked.csv'))